; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v13 ?v1)
             (pred_5 ?v3 ?v6)
             (pred_3 ?v13 ?v6)
             (pred_11 ?v5 ?v13 )
	     (pred_6 ?v13)
             (pred_12 ?v12)
             (pred_4 ?v3)
             (pred_9 ?v6)
             (pred_2 ?v13)
             (pred_8 ?v3)
             (pred_7 ?v13)
             (pred_10 ))



(:action op_1
:parameters (?v2 ?v10 ?v4 ?v7)
:precondition (and (pred_12 ?v2) (pred_12 ?v10) (pred_4 ?v4) (pred_9 ?v7)
          (pred_1 ?v2 ?v10) (pred_5 ?v4 ?v7)
                   (pred_3 ?v10 ?v7) (pred_6 ?v2) 
                   (pred_2 ?v10) (pred_8 ?v4))
:effect (and  (pred_7 ?v10) (not (pred_2 ?v10))))


(:action op_5
:parameters (?v2 ?v8)
:precondition (and (pred_12 ?v2) (pred_12 ?v8)
               (pred_6 ?v2) (pred_1 ?v2 ?v8) (pred_7 ?v8))
:effect (and (pred_6 ?v8) (not (pred_6 ?v2))))

(:action op_4
:parameters (?v2 ?v4)
:precondition (and (pred_12 ?v2) (pred_4 ?v4) 
                  (pred_6 ?v2) (pred_11 ?v4 ?v2) (pred_10 ))
:effect (and (pred_8 ?v4)
   (not (pred_11 ?v4 ?v2)) (not (pred_10 ))))


(:action op_2
:parameters (?v2 ?v9 ?v11)
:precondition (and (pred_12 ?v2) (pred_4 ?v9) (pred_4 ?v11)
                  (pred_6 ?v2) (pred_8 ?v11) (pred_11 ?v9 ?v2))
:effect (and (pred_8 ?v9) (pred_11 ?v11 ?v2)
        (not (pred_8 ?v11)) (not (pred_11 ?v9 ?v2))))

(:action op_3
:parameters (?v2 ?v4)
:precondition (and (pred_12 ?v2) (pred_4 ?v4) 
                  (pred_6 ?v2) (pred_8 ?v4))
:effect (and (pred_10 ) (pred_11 ?v4 ?v2) (not (pred_8 ?v4)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_15 obj_05 obj_01 obj_03 obj_16 obj_13 obj_14 obj_10 obj_09 obj_06 obj_08 obj_04 obj_19 obj_12 obj_17
    obj_20 obj_02
    obj_18 obj_07
    )

    (:init
       (pred_10)

       (pred_12 obj_11)
       (pred_12 obj_15)
       (pred_12 obj_05)
       (pred_12 obj_01)
       (pred_12 obj_03)
       (pred_12 obj_16)
       (pred_12 obj_13)
       (pred_12 obj_14)
       (pred_12 obj_10)
       (pred_12 obj_09)
       (pred_12 obj_06)
       (pred_12 obj_08)
       (pred_12 obj_04)
       (pred_12 obj_19)
       (pred_12 obj_12)
       (pred_12 obj_17)
       (pred_9 obj_20)
       (pred_9 obj_02)
       (pred_4 obj_18)
       (pred_4 obj_07)

       (pred_1 obj_11 obj_03)
       (pred_1 obj_11 obj_15)
       (pred_1 obj_15 obj_16)
       (pred_1 obj_15 obj_05)
       (pred_1 obj_15 obj_11)
       (pred_1 obj_05 obj_13)
       (pred_1 obj_05 obj_01)
       (pred_1 obj_05 obj_15)
       (pred_1 obj_01 obj_14)
       (pred_1 obj_01 obj_05)
       (pred_1 obj_03 obj_10)
       (pred_1 obj_03 obj_16)
       (pred_1 obj_03 obj_11)
       (pred_1 obj_16 obj_09)
       (pred_1 obj_16 obj_13)
       (pred_1 obj_16 obj_15)
       (pred_1 obj_16 obj_03)
       (pred_1 obj_13 obj_06)
       (pred_1 obj_13 obj_14)
       (pred_1 obj_13 obj_05)
       (pred_1 obj_13 obj_16)
       (pred_1 obj_14 obj_08)
       (pred_1 obj_14 obj_01)
       (pred_1 obj_14 obj_13)
       (pred_1 obj_10 obj_04)
       (pred_1 obj_10 obj_09)
       (pred_1 obj_10 obj_03)
       (pred_1 obj_09 obj_19)
       (pred_1 obj_09 obj_06)
       (pred_1 obj_09 obj_16)
       (pred_1 obj_09 obj_10)
       (pred_1 obj_06 obj_12)
       (pred_1 obj_06 obj_08)
       (pred_1 obj_06 obj_13)
       (pred_1 obj_06 obj_09)
       (pred_1 obj_08 obj_17)
       (pred_1 obj_08 obj_14)
       (pred_1 obj_08 obj_06)
       (pred_1 obj_04 obj_19)
       (pred_1 obj_04 obj_10)
       (pred_1 obj_19 obj_12)
       (pred_1 obj_19 obj_09)
       (pred_1 obj_19 obj_04)
       (pred_1 obj_12 obj_17)
       (pred_1 obj_12 obj_06)
       (pred_1 obj_12 obj_19)
       (pred_1 obj_17 obj_08)
       (pred_1 obj_17 obj_12)
       (pred_2 obj_06)
       (pred_2 obj_04)
       (pred_3  obj_06 obj_20)
       (pred_3  obj_04 obj_02)
       (pred_7 obj_11)
       (pred_7 obj_15)
       (pred_7 obj_05)
       (pred_7 obj_01)
       (pred_7 obj_03)
       (pred_7 obj_16)
       (pred_7 obj_13)
       (pred_7 obj_14)
       (pred_7 obj_10)
       (pred_7 obj_09)
       (pred_7 obj_08)
       (pred_7 obj_19)
       (pred_7 obj_12)
       (pred_7 obj_17)

       (pred_5  obj_18 obj_20)
       (pred_5  obj_07 obj_02)
       (pred_11 obj_18 obj_09)
       (pred_11 obj_07 obj_09)
       (pred_6 obj_01)
    )

    (:goal (and
       (pred_11 obj_18 obj_10)
    ))
(:constraints
  (always (not (pred_6 obj_16)))
)
)

; plan
1. (op_5 obj_01 obj_05)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_05)
   goals met: 0 of 1
2. (op_5 obj_05 obj_15)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_15)
   goals met: 0 of 1
3. (op_5 obj_15 obj_11)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_11)
   goals met: 0 of 1
4. (op_5 obj_11 obj_03)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_03)
   goals met: 0 of 1
5. (op_5 obj_03 obj_10)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_10)
   goals met: 0 of 1
6. (op_5 obj_10 obj_09)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_09)
   goals met: 0 of 1
7. (op_4 obj_09 obj_18)
   deleted: (pred_11 obj_18 obj_09) (pred_10)
   added: (pred_8 obj_18)
   goals met: 0 of 1
8. (op_5 obj_09 obj_10)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_10)
   goals met: 0 of 1
9. (op_3 obj_10 obj_18)
   deleted: (pred_8 obj_18)
   added: (pred_10) (pred_11 obj_18 obj_10)
   goals met: 1 of 1
